<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html;  charset=iso-8859-1">
	<TITLE>Projektdateien und Verzeichnisse</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.0  (Linux)">
	<META NAME="CREATED" CONTENT="20030305;14173900">
	<META NAME="CHANGED" CONTENT="20040421;18064600">
	<STYLE>
	<!--
		@page { margin: 2cm }
		H1.western { font-family: "Helvetica", sans-serif; font-size: 14pt }
		P { margin-bottom: 0.21cm; text-decoration: none }
		P.western { font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
		H2.western { font-family: "Helvetica", sans-serif; font-size: 12pt; font-style: normal }
		H2.cjk { font-size: 14pt; font-style: italic }
		H2.ctl { font-size: 14pt; font-style: italic }
		P.text-body-indent-western { margin-left: 1cm; font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
		P.text-body-indent-cjk { margin-left: 1cm }
		P.text-body-indent-ctl { margin-left: 1cm }
	-->
	</STYLE>
<META http-equiv=Content-Type content="text/html; charset=Windows-1252"></HEAD>
<BODY LANG="en-US" DIR="LTR">
<H1 CLASS="western">Projektdateien und Verzeichnisse</H1>
<H2 CLASS="western">Zusammenfassung von Projektdateien und Verzeichnissen</H2>
<P CLASS="western">Ein OmegaT-Projekt besteht aus folgenden Dateien und Verzeichnissen:</P>
<P CLASS="western">Ein Hauptprojektverzeichnis. Dieses Verzeichnis wird erstellt, wenn das Projekt erstellt wird.  Der Name wird vom Anwender vergeben.</P>
<P CLASS="text-body-indent-western"><I>omegat.project.</I>  Wenn das Projekt erstellt wurde, erstellt OmegaT automatisch nachfolgende Datei im Projektverzeichnis.  Zum &Ouml;ffnen eines Projektes mit OmegaT, seine 
<I>omegat.project</I>-Datei &ouml;ffnen.</P>
<P CLASS="text-body-indent-western"><I>&lt;projectname&gt;.tmx</I>.  Hierbei handelt es sich um die Translation Memory (Segmentenpaardatenbank), die vom Projekt exportiert wird. OmegaT erstellt sie automatisch und stellt sie jedes Mal dann in dieses Verzeichnis, wenn das Projekt kompiliert wird. Die Segmentenpaardatenbank enth&auml;lt die Segmente des Projektes, die vorhanden waren, als es das letzte mal kompiliert wurde. Es importiert keinerlei Segmente vor irgendwelchen Segmentenpaardatenbanken, die sich im 
<I>/tm</I>-Verzeichnis befinden.  .</P>
<P CLASS="western">Verzeichnis: <I>/source</I>.  Alle Dateien, die &uuml;bersetzt werden sollen, m&uuml;ssen nach Erstellung des Projektes und vor dem Aufmachen desselben in dieses Verzeichnis gestellt werden.  Alle Dateien in diesem Verzeichnis und den nachfolgenden Unterverzeichnissen sind Teil des zu &uuml;bersetzenden Projektes, vorausgesetzt das Format wird unterst&uuml;tzt und sie haben die entsprechende Dateiendung.</P>
<P CLASS="text-body-indent-western"><I>*.txt</I>, <I>*.xhtml, *.html</I>,
<I>*.sxw:</I> Ausgangsdateien, die zur &Uuml;bersetzung ins Projekt importiert werden. Dateien mit anderen Endungen k&ouml;nnen dann eingesehen werden, wenn deren Erweiterungen in den voreingestellten Erweiterungen aufgelistet sind.</P>
<P CLASS="text-body-indent-western">Dateien, die im Verzeichnis <I>/source</I> enthalten sind und nicht ins Projekt importiert werden, werden beim Kompilieren unver&auml;ndert ins Verzeichnis <I>/target</I>
&uuml;bertragen. Dadurch k&ouml;nnen komplette Websites, die im Verzeichnis
<I>/source</I> gespeichert sind, zusammen mit ihrem Grafikdateien (wie z.B. GIF und JPEF) ins Verzeichnis <I>/Ziel</I> gespiegelt werden. 
</P>
<P CLASS="western">Verzeichnis: <I>/glossary</I>.  Hier kann man nach der Erstellung des Projektes die <A HREF="en_Gloss.html">Glossare</A>
, die man verwenden m&ouml;chte hineinstellen.  </P>
<P CLASS="text-body-indent-western"><I>*.tab</I>:  Glossardateien.</P>
<P CLASS="western">Verzeichnis: <I>/omegat</I>.  OmegaT stellt beim Erstellen des Projektes automatisch folgende Dateien ins Verzeichnis:</P>
<P CLASS="text-body-indent-western"><I>file_e<SPAN STYLE="text-decoration: none"><SPAN STYLE="text-decoration: none"><SPAN STYLE="text-decoration: none">xtension_mapping:</SPAN></SPAN></SPAN></I><SPAN STYLE="text-decoration: none"><SPAN STYLE="text-decoration: none"><SPAN STYLE="text-decoration: none">
OmegaT sucht Dateiarten aufgrund derer Dateinamenerweiterungen;  StarOffice-Dateien m&uuml;ssen z.B. die Endung .sxw haben, damit sie erkannt werden.  Es ist m&ouml;glich, OmegaT durch &Auml;nderung dieser Datei dazu zu zwingen, Dateien mit anderen Endungen (keinen Formaten!) zu erkennen.</SPAN></SPAN></SPAN>
</P>
<P CLASS="text-body-indent-western" STYLE="text-decoration: none"><I>project_save.tmx:</I>
diese Datei wird erstellt, wenn das Projekt das erste mal gespeichert wird.  Sie ist in TMX-Format und stellt die Segmentenpaardatenbank f&uuml;r das Projekt dar.</P>
<P CLASS="text-body-indent-western"><I><SPAN STYLE="text-decoration: none">word</SPAN>_counts:
</I>diese Datei enth&auml;lt zwei Wortanzahlen des gesamten Projektes:  eine mit und eine ohne der 100% gleichen Segmente.</P>
<P CLASS="western">Verzeichnis: <I>/target</I>.  OmegaT stellt die &uuml;bersetzten Dateien nach dem Kompilieren in dieses Verzeichnis.</P>
<P CLASS="text-body-indent-western"><I>*.txt, *.xhtml, *.html, *.sxw</I>: &uuml;bersetzte Dateien<BR>Nicht &uuml;bersetzte Dateien werden beim Kompilieren aus dem Verzeichnis <I>/source</I>
 ins </P>
<P CLASS="western">Verzeichnis: <I>/tm</I> &uuml;bertragen. Hier werden die zu verwendenden <A HREF="en_TMFormats.html">Segmentenpaardatenbanken</A> nach dem Erstellen/vor dem Laden des Projektes hineingestellt. Hinweis:    egal, ob man mit existierenden Segmentenpaardatenbanken arbeitet oder nicht, OmegaT erstellt auf jeden Fall eine Arbeits-Segmentenpaardatenbank f&uuml;r das Projekt, mit Namen <SPAN STYLE="text-decoration: none"><I>project_save.tmx</I>, im Verzeichnis <I>/omegat</I> wenn das Projekt gespeichert wird und stellt eine exportierte Segmentenpaardatenbank </SPAN>in das Hauptverzeichnis, wenn das Projekt kompiliert wird.</P>
<P CLASS="text-body-indent-western"><I>*.tmx</I>: Segmentenpaardatenbanken, die w&auml;hrend vorheriger Projekte erstellt wurden. Die <I>*.tmx</I>-Dateien m&uuml;ssen im Format TMX Version 1 sein.</P>
<H2 CLASS="western">&Auml;ndern des Speicherortes f&uuml;r Projektdateien und Verzeichnisse</H2>
<P CLASS="western">Die Projektverzeichnisse werden erstellt, wenn man ein Projekt erstellt.  Als Voreinstellung befinden sie sich alle im Hauptverzeichnis des Projekts, aber man kann auch alternative Verzeichnisse einstellen, indem man auf die Schaltfl&auml;che <I>Durchsuchen</I> klickt.  Deshalb k&ouml;nnen alle Glossare in einem extra Verzeichnis stehen und man w&auml;hlt dann dieses Verzeichnis beim Erstellen eines neuen Projektes aus anstatt diese Segmentenpaardatenbanken in das neu erstellte Verzeichnis <I>/tm</I> kopieren zu m&uuml;ssen</P>
<P CLASS="western" STYLE="font-style: normal">Um im Nachhinein den Ort eines Verzeichnisses, z.B. das eines vorhandenen Projektes, zu &auml;ndern, ist das betreffende Verzeichnis zu l&ouml;schen.  (Diesen Schritt niemals ausf&uuml;hren, wenn das Projekt ge&ouml;ffnet ist.)  Wenn das Projekt dann das n&auml;chste Mal ge&ouml;ffnet wird, erkennt OmegaT, dass einige Verzeichnisse fehlen und zeigt den Dialog zur Verzeichniswahl an, &uuml;ber den man neue Orte w&auml;hlen kann.</P><br><P><A HREF="en_OmegaT.html">Zur&uuml;ck zur &Uuml;bersicht</A></P>
</BODY>
</HTML>