<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html;  charset=iso-8859-1">
	<TITLE>Die ersten Schritte - ein Beispielprojekt</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.0  (Linux)">
	<META NAME="CREATED" CONTENT="20030305;14173800">
	<META NAME="CHANGED" CONTENT="20040421;18011400">
	<STYLE>
	<!--
		@page { margin: 2cm }
		H1.western { font-family: "Helvetica", sans-serif; font-size: 14pt }
		P { margin-bottom: 0.21cm; text-decoration: none }
		P.western { font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
	-->
	</STYLE>
<META http-equiv=Content-Type content="text/html; charset=Windows-1252"></HEAD>
<BODY LANG="en-US" DIR="LTR">
<H1 CLASS="western"><B>Die ersten Schritte - ein Beispielprojekt</B></H1>
<P CLASS="western">Dieser Ablauf dient einzig und allein der Erkl&auml;rung;  er muss in der Praxis nicht hundertprozentig eingehalten werden.</P>
<UL>
	<LI><P CLASS="western">OmegaT aufrufen.  
	</P>
	<LI><P CLASS="western">Ein neues Projekt mit <I>Datei</I>
	&gt; <I>Erstellen</I> in der Men&uuml;leiste erstellen. </P>
	<LI><P CLASS="western">Es wird ein Datei-Navigationsdialog angezeigt.  &Uuml;ber diesen Dialog ist nun jenes Verzeichnis auszuw&auml;hlen, in dem das Projekt entstehen soll.  
	</P>
	<LI><P CLASS="western">Einen Dateinamen f&uuml;r das Projekt in das entsprechende Feld eingeben (z.B.
	<I>ABC</I>) und best&auml;tigen.</P>
	<LI><P CLASS="western">Es wird ein weiterer Dialog aufgerufen, welcher die Projektverzeichnisse anzeigt.  Wie aus dem Dialog zu ersehen ist, schl&auml;gt OmegaT vor, ein neues Verzeichnis mit dem gew&auml;hlten Namen zu erstellen (z.B.  <I>ABC</I>), und darunter weitere f&uuml;nf Unterverzeichnisse.  Man kann die Orte dieser voreingestellten Verzeichnisse &auml;ndern, aber zu Versuchszwecken sollten die vorgeschlagenen Verzeichnisse best&auml;tigt werden.  (Die Projektdateien und Verzeichnisse werden <A HREF="en_FilesDirs.html">hier</A> detailliert beschrieben.)</P>
	<LI><P CLASS="western">Nun die Sprachcodes und deren zus&auml;tzliche lokale Codes f&uuml;r die Ausgangs- und Zielsprache eingeben - z.B. DE-CH f&uuml;r Deutsch (Schweiz), EN-UK f&uuml;r Englisch (Gro&szlig;britannien). Die Codes selbst sind nicht so wichtig so lange man die Segmentenpaardatenbanken nicht mit Kunden oder Kollegen austauschen m&ouml;chte und in jenem Fall sollten die Standard-Codes verwendet werden (normalerweise ISO).</P>
	<LI><P CLASS="western">OmegaT erstellt nun ein Hauptverzeichnis (welches sich auch auf das &ldquo;Projekt-Hauptverzeichnis&rdquo; bezieht) mit den Namen, der vorher gew&auml;hlt wurde (z.B. <I>ABC</I>).  Unter dem Projekt-Hauptverzeichnis befinden sich f&uuml;nf Unterverzeichnisse:  <I>/glossary</I>, <I>/source</I>,
	<I>/omegat</I>, <I>/target</I> und <I>/tm</I>.  
	</P>
	<LI><P CLASS="western">Eine zu &uuml;bersetzende Datei finden.  Die Datei als Textdatei mit der Dateinamenerweiterung <I>*.txt</I> speichern, und ins Verzeichnis <I>/source</I> stellen.
		</P>
	<LI><P CLASS="western">Das soeben erstellte Projekt mit 
	<I>Datei</I> &gt; <I>&Ouml;ffnen</I> &ouml;ffnen.  OmegaT kontrolliert automatisch zuerst das zuletzt ge&ouml;ffnete Verzeichnis.  Das Projekt-Hauptverzeichnis wird mit dem OmegaT-Symbol angezeigt, was bedeutet, dass es sich um ein Projekt handelt.</P>
	<LI><P CLASS="western">Das Projekt &ouml;ffnen, wobei zun&auml;chst das Projektverzeichnis auszuw&auml;hlen ist, welches durch das Symbol gekennzeichnet ist (Doppelklicken oder ausw&auml;hlen und mit "&Ouml;ffnen" best&auml;tigen), dann die Datei  <I>omegat.project</I> &ouml;ffnen. Versuchen Sie nicht, eine andere Datei zu &ouml;ffnen, wie z.B. Ihre Datei mit dem Ausgangstext - das funktioniert nicht!</P>
	<LI><P CLASS="western">OmegaT &ouml;ffnet das Projekt und zeigt den Text der zu &uuml;bersetzenden Datei im OmegaT-Hauptfenster. 
	</P>
	<LI><P CLASS="western">Den Cursor in das Feld f&uuml;r den Zieltext des ersten Segments stellen, zwischen die Tags &lt;segment 0001&gt; und &lt;end segment&gt;. Die &Uuml;bersetzung eingeben und den Ausgangstext l&ouml;schen. Zum Best&auml;tigen <I>Eingabe</I> dr&uuml;cken.  
	</P>
	<LI><P CLASS="western">Dieser Schritt wird mit jedem Segment ausgef&uuml;hrt, bis der komplette Text &uuml;bersetzt ist.  
	</P>
	<LI><P CLASS="western">Nun ist nacheinander <I>Datei</I> &gt; <I>Speichern</I> und dann
	<I>Datei</I> &gt; <I>Kompilieren</I> anzuw&auml;hlen.  OmegaT kann nun mit <I>(Datei</I>
	&gt; <I>Beenden</I>)<I>beendet werden.</I>  
	</P>
	<LI><P CLASS="western">Die &uuml;bersetzte Datei befindet sich nun im Verzeichnis <I>/target</I>.</P>
</UL><br><P><A HREF="en_OmegaT.html">Zur&uuml;ck zur &Uuml;bersicht</A></P>
</BODY>
</HTML>