<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html;  charset=iso-8859-1">
	<TITLE>Installation und Konfiguration</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.0  (Linux)">
	<META NAME="CREATED" CONTENT="20030305;14173800">
	<META NAME="CHANGED" CONTENT="20040421;17460700">
	<STYLE>
	<!--
		@page { margin: 2cm }
		H1.western { font-family: "Helvetica", sans-serif; font-size: 14pt }
		P { margin-bottom: 0.21cm; text-decoration: none }
		P.western { font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
		P.text-body-indent-western { margin-left: 1cm; font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
		P.text-body-indent-cjk { margin-left: 1cm }
		P.text-body-indent-ctl { margin-left: 1cm }
		H3.western { font-family: "Helvetica", sans-serif; font-size: 12pt }
		H2.western { font-family: "Helvetica", sans-serif; font-size: 12pt; font-style: normal }
		H2.cjk { font-size: 14pt; font-style: italic }
		H2.ctl { font-size: 14pt; font-style: italic }
	-->
	</STYLE>
<META http-equiv=Content-Type content="text/html; charset=Windows-1252"></HEAD>
<BODY LANG="en-US" DIR="LTR">
<H1 CLASS="western"><B>Installation und Konfiguration</B></H1>
<H2 CLASS="western">Installation</H2>
<P CLASS="western">Die Installation besteht aus drei Schritten.  Erstens muss J2RE installiert werden (sofern es noch nicht installiert ist).  Zweitens muss OmegaT installiert werden.  Drittens muss die Konfiguration erfolgen.  Es ist unerheblich in welcher Reihenfolge J2RE und OmegaT installiert werden.  Die Konfiguration ist nicht unbedingt notwendig, aber das Aufrufen der Anwendung wird dadurch benutzerfreundlicher.</P>
<H3 CLASS="western">Installation des Java Runtime Environments</H3>
<P CLASS="western">Das Java Runtime Environment (J2RE) erlaubt es, Java-Programme auf dem eigenen Computer auszuf&uuml;hren.  Es steht sowohl als Einzelprodukt als auch als Teil des Java-Entwicklerkits zur Verf&uuml;gung.  
</P>
<P CLASS="western">Java gibt es auch als Plugin f&uuml;r Webbrowser.  Mit dieser Art von Java ist es <B>nicht</B> m&ouml;glich mit OmegaT zu arbeiten.
</P>
<P CLASS="western">JavaScript ist ein anderes Produkt und hat technisch absolut nichts mit Java zu tun.</P>
<P CLASS="western">Wenn man mit OmegaT arbeiten m&ouml;chte, <B>muss</B> die J2RE auf dem Computer installiert sein.  OmegaT funktioniert nicht ohne J2RE. Versuchen Sie nicht, OmegaT ohne J2RE zu starten.  Es w&auml;re reine Zeitvergeudung!</P>
<P CLASS="western">Wenn man nicht sicher ist, ob J2RE auf dem Computer installiert ist, reicht es aus OmegaT zu installieren und zu sehen, ob es funktioniert (die Installation von OmegaT ist nachfolgend beschrieben).  Wenn nichts geschieht oder Fehlermeldungen angezeigt werden ist es sehr wahrscheinlich, dass das Java Runtime Environment nicht installiert ist.  Sollte dies der Fall sein, muss man es sich besorgen und installieren.  
</P>
<P CLASS="text-body-indent-western">Windows Anwender:  um zu kontrollieren, welche Version des Java Runtime Environments installiert ist (sofern sie installiert ist) indem man folgende Tasten dr&uuml;ckt/Felder aktiviert: <I>Start-Taste/Windows-Taste </I>&gt;<I>Einstellungen</I> &gt; Systemsteuerung.  Wenn J2RE installiert ist, ist das Java-Symbol f&uuml;r das &ldquo;Java(TM)2 Runtime Environment, Standardversion 1.3.0_01&rdquo; oder &auml;hnlich vorhanden.</P>
<P CLASS="text-body-indent-western">Linux Anwender:  einfach <I>Java -version</I> in die Kommandozeile eingeben.  Die installierte Version wird als Antwort angezeigt (sofern diese nat&uuml;rlich auf dem System installiert ist).</P>
<P CLASS="western">J2RE kann man bei nachfolgenden Links herunterladen.  Es ist gratis (siehe Lizenzbedingungen), aber die Namenskonventionen k&ouml;nnen das Auffinden der richtigen Version etwas schwierig gestalten.  Man ben&ouml;tigt die richtige Version f&uuml;r das eigene Betriebssystem (Linux, Windows, usw.).  Die Dateigr&ouml;&szlig;e des J2RE ist ca. 14 MB.  </P>
<P CLASS="text-body-indent-western"><I>(Hinweis:  um seine Anwender durcheinander zu bringen &auml;ndert Sun regelm&auml;&szlig;ig die Namen seiner Produkte.  Also sind alle Versionen von JRE &uuml;ber 1 als &ldquo;Java 2&rdquo; bekannt, deshalb hei&szlig;t das Java Runtime Environment jetzt J2RE. Das Java Runtime Environment ist auch als Java Virtual Machine oder JVM und bei Macintosh als MRJ bekannt.  Das Entwicklerkit ist als Java Developer's Kit (JDK), Software Developer's Kit (SDK), und nun auch als J2SE, J2EE und J2ME, je nach Version, bekannt.  Zumindest meine ich, dass es so ist. Aber ich bin bei denen dabei, denen das ganze nicht so klar ist.)</I></P>
<P CLASS="western">OmegaT 1.4.2 m&uuml;sste mit jeder Version des J2RE ab 1.2 oder h&ouml;her laufen.  Wir empfehlen auf jeden Fall die neueste Version von J2RE, da &auml;ltere Java-Versionen bestimmte Eigenschaften eventuell nicht unterst&uuml;tzen.</P>
<P CLASS="western">Als Alternative zu J2RE kann man auch das Entwicklerkit installieren.  Das Entwicklerkit beinhaltet eine eigene Version von J2RE und erlaubt es, OmegaT zu ver&auml;ndern.  </P>
<P CLASS="western"><I>Windows und Linux Anwender k&ouml;nnen das Java Runtime Environment hier herunterladen:</I></P>
<P CLASS="text-body-indent-western"><A HREF="http://java.sun.com/getjava/index.html">Sun</A>
(alle Benutzeroberfl&auml;chen)</P>
<P CLASS="text-body-indent-western"><A HREF="http://www.blackdown.org/java-linux.html">Blackdown</A>
(Linux)</P>
<P CLASS="western">Bei Macintosh OS X Anwendern sollte das Java Runtime Environment bereits installiert sein.</P>
<P CLASS="western">Es ist bekannt, dass fr&uuml;here Versionen von OmegaT auf dem MRJ f&uuml;r Macintosh OS 9 laufen.  Die Version 1.4.2 <I>sollte</I> auf dieser Benutzeroberfl&auml;che funktionieren, was allerdings noch nicht getestet wurde.</P>
<P CLASS="western">W&auml;hrend der J2RE-Installation sind die dazugeh&ouml;rigen Anweisungen zu beachten.</P>
<H3 CLASS="western">Installation von OmegaT</H3>
<P CLASS="western">Einfach den Inhalt des Archivs in das gew&uuml;nschte Verzeichnis extrahieren.  Das Archiv kann in *.zip oder *.tar.gzip Form sein.  Anwender von Linux und Mac (Stuffit) d&uuml;rften keinerlei Probleme mit beidem haben;  bei Windows Anwendern ist es m&ouml;glich, dass sie kein Tool f&uuml;r letztere haben.</P>
<H2 CLASS="western">Aufruf der Anwendung</H2>
<H3 CLASS="western">Windows und Macintosh OS X</H3>
<P CLASS="western">Auf die Datei <I>OmegaT.jar</I> im Windows-Explorer klicken.</P>
<H3 CLASS="western">Linux</H3>
<P CLASS="western"><I>Java -jar OmegaT.jar</I> &uuml;ber die Kommandozeile ausf&uuml;hren.  Die Schreibweise von OmegaT ist genau zu beachten - die Gro&szlig;buchstaben sind wichtig. 
</P>
<P CLASS="western">Wenn Java nicht daf&uuml;r konfiguriert wurde, den Ort der OmegaT-Dateien zu finden, m&uuml;ssen zuerst die Verzeichnisse auf jene umgestellt werden, die die Datei OmegaT.jar enthalten.  
</P>
<P CLASS="western">Wenn man die Java-Pfadvariable nicht eingestellt hat, muss man den kompletten Pfad angeben.  Wenn keiner von den beiden oben beschriebenen Schritten ausgef&uuml;hrt wurde, ist es m&ouml;glich, dass die Routine zum Aufruf der Software nach einem &auml;hnlichen Pfad wie den folgenden sucht:</P>
<P CLASS="western" STYLE="margin-left: 1cm">cd /home/user/OmegaT<BR>/home/user/j2re1.4.2/bin/java -jar OmegaT</P>
<H2 CLASS="western">Konfiguration (nur f&uuml;r Linux)</H2>
<P CLASS="western">Wenn man nicht sehr gut mit Linux umgehen kann, dann macht folgender Schritt das Aufrufen von OmegaT anwenderfreundlicher:</P>
<P CLASS="western">Erstellen eines Shell-Scripts mit Hilfe einer Textdatei folgenden Inhalts:</P>
<P CLASS="text-body-indent-western" STYLE="margin-left: 2cm">#!/bin/bash<BR>cd
<I>&lt;OmegaT&gt;</I><BR><I>&lt;java&gt;</I>java -jar OmegaT.jar</P>
<P CLASS="western">wobei <I>&lt;OmegaT&gt;</I> das Verzeichnis ist, in dem sich <I>OmegaT.jar</I> befindet und <I>&lt;java&gt;</I> das Verzeichnis mit der J2RE Bin&auml;rdatei ist (die Datei mit Namen <I>java</I>).  Wenn der Java-Pfad als variabel eingestellt ist, muss dieses Verzeichnis nicht angegeben werden und <I>java -jar OmegaT.jar</I> ist ausreichend.  Die Angabe des Verzeichnisses ist notwendig, wenn der Java-Pfad nicht als variabel eingestellt wurde und wenn auf dem System mehr als eine Java-Version installiert sind und sicherzustellen ist, dass OmegaT mit der richtigen Version aufgerufen wird.</P>
<P CLASS="western">Die Textdatei als <I>OmegaT</I> speichern und die Rechte auf ausf&uuml;hrbar setzen (z.B. bei Konqueror, Kontextmen&uuml; &gt;
<I>Eigenschaften</I> &gt; <I>Rechte</I> &gt; <I>Ausf&uuml;hren</I>).  Man kann OmegaT nun ausf&uuml;hren, indem man auf der Kommandozeile einfach <I>OmegaT</I>eingibt.  Wenn man ein Symbol auf dem Desktop anzeigen m&ouml;chte, so ist dies auf Ausf&uuml;hrung der Shell-Script-Datei einzustellen.</P><br><P><A HREF="en_OmegaT.html">Zur&uuml;ck zur &Uuml;bersicht</A></P>
</BODY>
</HTML>