<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html;  charset=iso-8859-1">
	<TITLE>Arbeiten mit OpenOffice.org und StarOffice Dateien</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.0  (Linux)">
	<META NAME="CREATED" CONTENT="20030305;14173900">
	<META NAME="CHANGED" CONTENT="20040421;17295800">
	<STYLE>
	<!--
		@page { margin: 2cm }
		H1.western { font-family: "Helvetica", sans-serif; font-size: 14pt }
		P { margin-bottom: 0.21cm; text-decoration: none }
		P.western { font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
		H2.western { font-family: "Helvetica", sans-serif; font-size: 12pt; font-style: normal }
		H2.cjk { font-size: 14pt; font-style: italic }
		H2.ctl { font-size: 14pt; font-style: italic }
	-->
	</STYLE>
<META http-equiv=Content-Type content="text/html; charset=Windows-1252"></HEAD>
<BODY LANG="en-US" DIR="LTR">
<H1 CLASS="western"><B>Arbeiten mit OpenOffice.org und StarOffice Dateien</B></H1>
<P CLASS="western">Siehe auch <A HREF="en_Tags.html">Editieren von formatierten Texten</A></P>
<H2 CLASS="western">OpenOffice.org und StarOffice: der Unterschied</H2>
<P CLASS="western">OpenOffice.org und StarOffice sind, im weiteren Sinne ein und dasselbe Programm.  OpenOffice.org ist Open Source, was im wesentlichen bedeutet, dass es eine freie Software ist und somit frei kopiert werden kann.  StarOffice ist ein kommerzielles Produkt:  man muss eine Lizenz f&uuml;r jedes System kaufen, auf dem man es verwenden will.  StarOffice beinhaltet einige Komponenten, die bei OpenOffice.org nicht vorhanden sind;  durch den Kauf einer Lizenz hat man auch Recht auf technischen Support.  Was dieses Handbuch betrifft sind alle Bez&uuml;ge auf OpenOffice.org auch f&uuml;r StarOffice g&uuml;ltig.</P>
<H2 CLASS="western">OpenOffice.org und OmegaT</H2>
<P CLASS="western">OmegaT ist eine eigenst&auml;ndige Anwendung.  Es ben&ouml;tigt weder OpenOffice.org noch StarOffice, MS Word oder irgend ein andere Textverarbeitungsprogramm.  
</P>
<P CLASS="western">Doch OpenOffice.org/StarOffice erweitern OmegaTs Funktionalit&auml;t um einiges, denn sie erlauben das Arbeiten mir Formaten, die OmegaT nicht direkt unterst&uuml;tzt. Dies beinhaltet insbesondere MS Word, MS Excel, MS Powerpoint und RTF-Dateien. Zum Vorbereiten von Dateien in diesen Formaten zum Verarbeiten mit OmegaT werden sie einfach mit OpenOffice.org ge&ouml;ffnet und mit "Speichern unter" im OpenOffice.org Format gespeichert.  Wenn die &Uuml;bersetzung dann fertig ist, &ouml;ffnet man die Dateien wieder mit OpenOffice.org und speichert sie mit "Speichern unter" im Originalformat.</P>
<P CLASS="western">OpenOffice.org/StarOffice f&uuml;gen auch weitere Funktionen zu den Hauptfunktionen von OmegaT hinzu. Die Rechtschreibpr&uuml;fung wie auch die Segmentierung auf Satzbasis anstatt auf Absatzbasis sind zwei Funktionen, die OmegaT selbst nicht hat, die aber mit Hilfe von OpenOffice.org vorhanden sind.</P>
<P CLASS="western" STYLE="font-style: normal; text-decoration: none"><FONT COLOR="#330000"><FONT FACE="Nimbus Sans L">Mit OmegaT sind OpenOffice.org 1.0/StarOffice 6.0 oder h&ouml;her zu verwenden.  Fr&uuml;here Versionen (z.B. die OpenOffice.org Beta-Version) funktioniert eventuell nicht.  StarOffice 5.2 funktioniert ganz bestimmt <B>nicht</B>.</FONT></FONT></P>
<H2 CLASS="western">Hinweise und Tipps</H2>
<P CLASS="western">Es ist sicherzustellen, dass die MS Word-Dateien nicht mit der Option &ldquo;Schnellspeicherung&rdquo; gespeichert werden, ansonsten wird OpenOffice.org sie wahrscheinlich nicht lesen k&ouml;nnen.</P>
<P CLASS="western">Niemals OpenOffice.org Dateien mit OmegaT &ouml;ffnen, die mit der aktiven Funktion &ldquo;Revision&rdquo; (also &ldquo;&Auml;nderungen aufzeichnen&rdquo;) gespeichert wurden. Vor dem &Ouml;ffnen in OmegaT erst die &Auml;nderungen akzeptieren und dann die Funktion deaktivieren.  Dieses Problem tritt h&auml;ufig auf, wenn man MS Word-Dateien erh&auml;lt, die mit aktiver &ldquo;Revisions&rdquo;-Funktion gespeichert wurden und man dies nicht wei&szlig;. OpenOffice.org unterst&uuml;tzt diese Funktion (die ja auch sehr n&uuml;tzlich ist), aber sie darf nicht bei OmegaT verwendet werden.</P>
<P CLASS="western">Man sollte sich also die Werkzeuge zur Rechtschreibpr&uuml;fung von OpenOffice.org f&uuml;r die gew&uuml;nschte/n Zielsprache/n besorgen und installieren. Bevor man ein Projekt mit OpenOffice.org-Dateien das erste Mal l&auml;dt, sind diese in OpenOffice.org zu &ouml;ffnen und die Sprache des Textes ist auf die Zielsprache zu &auml;ndern, indem man den gesamten Text mit <I>Strg-A</I> markiert und dann mit <I>Format</I> &gt; <I>Zeichen</I> &gt; <I>Sprache</I> die Zielsprache einstellt. Es ist dann m&ouml;glich, OpenOffice.org f&uuml;r die Rechtschreibpr&uuml;fung nach Beenden und Kompilieren der &Uuml;bersetzung zu verwenden. Die Sprache kann nach dem Kompilieren ge&auml;ndert werden, aber wenn man dann nochmal kompiliert wird die Sprache jedes Mal wieder auf die des Ausgangstextes zur&uuml;ckgesetzt.</P>
<P CLASS="western" STYLE="font-weight: medium">Nach dem Kompilieren eines Textes im OpenOffice.org-Format kontrollieren, ob der gesamte Text &uuml;bersetzt wurde.  Nach der &Uuml;bersetzung ist es eventuell von Vorteil die Datei nochmal mit OpenOffice.org zu &ouml;ffnen, um die Rechtschreibkorrektur dar&uuml;berlaufen zu lassen.  Es kann auch sein, dass OmegaT bestimmte Textteile, wie Kopf- und Fu&szlig;zeilen nicht erkennt und somit nicht zur &Uuml;bersetzung anzeigt.  
</P>
<P CLASS="western" STYLE="font-weight: medium">Wenn OpenOffice.org eine &uuml;bersetzte Datei nicht &ouml;ffnen kann, wurden w&auml;hren der &Uuml;bersetzung wahrscheinlich Tags besch&auml;digt.  In diesem Fall nochmal das Projekt &ouml;ffnen und mit Tags pr&uuml;fen die kaputten Segmente suchen.</P><br><P><A HREF="en_OmegaT.html">Zur&uuml;ck zur &Uuml;bersicht</A></P>
</BODY>
</HTML>