<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html;  charset=iso-8859-1">
	<TITLE>Speichern, Revision und Kompilieren der &Uuml;bersetzung </TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.0  (Linux)">
	<META NAME="CREATED" CONTENT="20030305;14173900">
	<META NAME="CHANGED" CONTENT="20040421;17362200">
	<STYLE>
	<!--
		@page { margin: 2cm }
		H1.western { font-family: "Helvetica", sans-serif; font-size: 14pt }
		P { margin-bottom: 0.21cm; text-decoration: none }
		P.western { font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
		H2.western { font-family: "Helvetica", sans-serif; font-size: 12pt; font-style: normal }
		H2.cjk { font-size: 14pt; font-style: italic }
		H2.ctl { font-size: 14pt; font-style: italic }
	-->
	</STYLE>
<META http-equiv=Content-Type content="text/html; charset=Windows-1252"></HEAD>
<BODY LANG="en-US" DIR="LTR">
<H1 CLASS="western">Speichern, Revision und Kompilieren der &Uuml;bersetzung 
</H1>
<H2 CLASS="western">Speichern</H2>
<P CLASS="western">Die Arbeit kann jederzeit durch Auswahl von <I>Datei</I>
&gt; <I>Speichern</I>, oder mittels Tastenkombination <I>Ctrl+S</I> gespeichert werden.  </P>
<P CLASS="western">Das speichert die &Uuml;bersetzung nicht als Dokument, sondern als momentane Segmentenpaardatenbank in der Datei
<I>/omegat/project_save.tmx</I>.  .</P>
<H2 CLASS="western">Revision</H2>
<P CLASS="western">Zur Revision des Textes durch Vergleich der &Uuml;bersetzung mit dem Original, den Text einfach Segment f&uuml;r Segment &uuml;berarbeiten und mit 
<I>Eingabe</I> von Segment zu Segment best&auml;tigen.  &Uuml;bersetzer, die an andere CAT-Tools gewohnt sind, werden diese praktische Methode zur Revision von Entw&uuml;rfen zu sch&auml;tzen wissen.</P>
<H2 CLASS="western">Kompilieren</H2>
<P CLASS="western">Keine Angst vorm Computerjargon!  
</P>
<P CLASS="western">Wenn man mit OmegaT &uuml;bersetzt &uuml;berschreibt man den Originaltext nicht, sondern erstellt &Uuml;bersetzungen eines jeden Absatzes in einer anderen Datei. Das Kompilieren ist ganz einfach der Prozess, bei dem OmegaT die Segmente des Ausgangstexts in der neuen Datei mit den &Uuml;bersetzungen ersetzt. Es baut auch eine Segmentenpaardatenbank in endg&uuml;ltiger und wiederverwendbarer Form auf.  Man muss nicht warten, bis die &Uuml;bersetzung fertig ist, um zu kompilieren;  man kann so oft kompilieren, wie man will.</P>
<H2 CLASS="western">So sch&uuml;tzt man sich vor Katastrophen</H2>
<UL>
	<LI><P CLASS="western">Regelm&auml;&szlig;ig Kopien von der Datei 
<I>/OmegaT/project_save.tmx</I> machen. Diese Datei mit einer Seriennummer oder dem Erstellungsdatum der Kopie versehen - z.B. <I>/OmegaT/project_save.tmx-01</I> oder <I>/OmegaT/project_save.tmx-04-05-04</I>. Diese Datei kann auch auf andere Medien wie Disketten zu einem einfachen und schnellen Backup &uuml;bertragen werden.  Beim &Uuml;bersetzen von formatierten Dateien (StarOffice/OpenOffice.org oder HTML) ist es m&ouml;glich, dass die Datei <I>project_save.tmx</I> wesentlich kleiner als die Ausgangs- oder Zieldateien ist.</P>
	<LI><P CLASS="western">So lange man OmegaT noch nicht allzu gut kennt, sollte man das Projekt regelm&auml;&szlig;ig kompilieren und kontrollieren, dass die kompilierte Datei die letzte Version der &Uuml;bersetzung enth&auml;lt.</P>
	<LI><P CLASS="western" STYLE="font-style: normal">Man muss insbesondere dann sehr vorsichtig sein, wenn man w&auml;hrend der Bearbeitung eines Projektes &Auml;nderungen in den Dateien im Verzeichnis <I>/source</I> ausf&uuml;hrt. Manchmal m&ouml;chte man eventuell &Auml;nderungen in den Ausgangsdateien ausf&uuml;hren - zum Beispiel, um harte Zeilenschaltungen inmitten von S&auml;tzen auszuschalten. Wenn man die Ausgangsdatei &auml;ndert nachdem man bereits mit der &Uuml;bersetzung begonnen hat, ist es m&ouml;glich, dass OmegaT bereits &uuml;bersetzte Segmente nicht mehr finden kann. Also: immer vor irgendwelchen &Auml;nderungen an der Ausgangsdatei Sicherheitskopien - entweder von der/den Ausgangsdatei/en oder vom gesamten Projekt - machen.</P>
	<LI><P CLASS="western">Niemals ein neues Projekt erstellen oder ein anderes Projekt &ouml;ffnen solange ein Projekt ge&ouml;ffnet ist. Vor dem &Ouml;ffnen eines anderen Projektes immer das ge&ouml;ffnete Projekt schlie&szlig;en und wenn n&ouml;tig OmegaT neu starten.</P>
</UL>
</BODY><br><P><A HREF="en_OmegaT.html">Zur&uuml;ck zur &Uuml;bersicht</A></P>
</HTML>