<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html;  charset=iso-8859-1">
	<TITLE>Allgemeine Hinweise und Tipps</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.0  (Linux)">
	<META NAME="CREATED" CONTENT="20030305;14173900">
	<META NAME="CHANGED" CONTENT="20040421;17252200">
	<STYLE>
	<!--
		@page { margin: 2cm }
		H1.western { font-family: "Helvetica", sans-serif; font-size: 14pt }
		P { margin-bottom: 0.21cm; text-decoration: none }
		P.western { font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
	-->
	</STYLE>
<META http-equiv=Content-Type content="text/html; charset=Windows-1252"></HEAD>
<BODY LANG="en-US" DIR="LTR">
<H1 CLASS="western"><B>Allgemeine Hinweise und Tipps</B></H1>
<UL>
	<LI><P CLASS="western">Wenn man das Layout des Textes w&auml;hrend der &Uuml;bersetzung sehen will, kann man einfach eine Kopie der Originaldatei in einem Textverarbeitungsprogramm oder einem extra Fenster ge&ouml;ffnet halten.</P>
	<LI><P CLASS="western">Wenn man ein neues Projekt erstellt, die zu &uuml;bersetzenden Dateien in das Verzeichnis <I>/source</I> gestellt hat und OmegaT dennoch die Nachricht bringt, dass das Projekt leer ist, dann sind diese Dateien wahrscheinlich MS Word-Dateien und es wurde vergessen, sie ins StarOffice-Format zu konvertieren.</P>
	<LI><P CLASS="western" STYLE="font-style: normal">Wenn man eine Segmentenpaardatenbank nicht &ouml;ffnen kann, die von einem Kollegen oder einem Kunden kommt, dann ist es m&ouml;glich, dass diese in einem nicht unterst&uuml;tzten Format ist. Wenn es sich um eine <I>*.tmx</I>-Datei handelt, dann ist es wahrscheinlich eine h&ouml;here TMX-Version. OmegaT Version 1.4.2 unterst&uuml;tzt nur TMX-Version 1.</P>
	<LI><P CLASS="western" STYLE="font-style: normal">Niemals innerhalb eines ge&ouml;ffneten OmegaT-Projekts versuchen, ein neues Projekt zu erstellen oder ein anderes existierendes zu &ouml;ffnen. Dies kann dazu f&uuml;hren, dass die interne Segmentenpaardatenbank des aktiven Projekts auf das neue Projekt &uuml;bertragen wird.</P>
	<LI><P CLASS="western" STYLE="font-style: normal">Bei der Verarbeitung von MS Office-Dateien muss man sich daran erinnern, dass man diese ins OpenOffice.org-Format bringen muss und sie konvertierte Datei ins Verzeichnis <I>/source</I> stellen muss. Die original MS-Office-Datei nicht ins Unterverzeichnis <I>/source</I> stellen. Wenn n&ouml;tig einfach ein neues Verzeichnis daf&uuml;r erstellen, wie z.B. <I>/original</I>. 
	</P>
	<LI><P CLASS="western">Es k&ouml;nnte passieren, dass man nachdem man zu einem Segment an einer anderen Stelle eines gro&szlig;en Projektes gegangen ist, die Stelle nicht wieder findet, an der man gerade gearbeitet hat. Damit man die Stelle wieder findet, bevor man sich zu einer anderen Stelle des Projektes begibt, eine Markierung (wie z.B. "###") in das Segment einf&uuml;gen dann <I>Eingabe</I> dr&uuml;cken. Noch besser ist es auf jeden Fall, die Nummer des Segments zum Lesezeichen hinzuzuf&uuml;gen, denn sollte es mehrere identische Segmente geben, k&ouml;nnte es passieren, dass die Markierung in unterschiedlichen Segmenten gefunden wird. </P>
	<LI><P CLASS="western" STYLE="font-style: normal">Wenn man eine Markierung in die &Uuml;bersetzung einf&uuml;gt, um z.B. eine nicht gel&ouml;ste Frage anzuzeigen, niemals die Zeichen '?' oder '*' verwenden. Diese Zeichen werden als Jokerzeichen verwendet und deshalb k&ouml;nnen sie mit <I>Strg+F</I> nicht gefunden werden.</P>
</UL>
<br><P><A HREF="en_OmegaT.html">Zur&uuml;ck zur &Uuml;bersicht</A></P>
</BODY>
</HTML>