<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<meta http-equiv="content-type" content="text/html; charset=UTF-8">
	<TITLE>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1089; &#1090;&#1101;&#1075;&#1072;&#1084;&#1080; (&#1088;&#1072;&#1079;&#1084;&#1077;&#1090;&#1082;&#1086;&#1081;)</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.0  (Linux)">
	<META NAME="CREATED" CONTENT="20030305;14173900">
	<META NAME="CHANGED" CONTENT="20040421;17261800">
	<STYLE>
	<!--
		@page { margin: 2cm }
		H1.western { font-family: "Helvetica", sans-serif; font-size: 14pt }
		P { margin-bottom: 0.21cm; text-decoration: none }
		P.western { font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
		H3.western { font-family: "Helvetica", sans-serif; font-size: 12pt }
		H2.western { font-family: "Helvetica", sans-serif; font-size: 12pt; font-style: normal }
		H2.cjk { font-size: 14pt; font-style: italic }
		H2.ctl { font-size: 14pt; font-style: italic }
		P.text-body-indent-western { margin-left: 1cm; font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
		P.text-body-indent-cjk { margin-left: 1cm }
		P.text-body-indent-ctl { margin-left: 1cm }
	-->
	</STYLE>
</HEAD>
<BODY LANG="ru-RU" DIR="LTR">
<H1 CLASS="western"><B>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1089; &#1090;&#1101;&#1075;&#1072;&#1084;&#1080; (&#1088;&#1072;&#1079;&#1084;&#1077;&#1090;&#1082;&#1086;&#1081;)</B></H1>
<H2 CLASS="western">&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1090;&#1101;&#1075;&#1072;&#1084;&#1080;</H2>
<P CLASS="western">OmegaT &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074; (&#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; HTML, XHTML &#1080; OpenOffice.org/StarOffice) &#1074; &#1074;&#1080;&#1076;&#1077; &#1090;&#1101;&#1075;&#1086;&#1074;. &#1058;&#1101;&#1075;&#1080;, &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1074; OmegaT, &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1093; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;; OmegaT &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1102;&#1102; &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1072;&#1094;&#1080;&#1102;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1091;&#1102; &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1072;&#1094;&#1080;&#1102; &#1087;&#1088;&#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;. 
</P>
<P CLASS="western">&#1057; &#1090;&#1101;&#1075;&#1072;&#1084;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1086;. &#1045;&#1089;&#1083;&#1080; &#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1042; &#1093;&#1091;&#1076;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1092;&#1072;&#1081;&#1083; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;, &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1101;&#1090;&#1086; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; OpenOffice.org.</P>
<P CLASS="western">&#1061;&#1086;&#1090;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; OmegaT &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;. 
</P>
<H3 CLASS="western">&#1052;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1103;&#1094;&#1080;&#1103; &#1090;&#1101;&#1075;&#1072;&#1084;&#1080; &#1074; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; OpenOffice.org</H3>
<P CLASS="western">&#1058;&#1101;&#1075;&#1080; &#1074; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; OpenOffice.org &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100;. &#1069;&#1090;&#1080; &#1090;&#1101;&#1075;&#1080; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100;, &#1088;&#1072;&#1079;&#1084;&#1085;&#1086;&#1078;&#1072;&#1090;&#1100;, &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1080;&#1093; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1052;&#1086;&#1078;&#1085;&#1086;:</P>
<UL>
	<LI><P CLASS="western"><I>&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;</I> &#1090;&#1101;&#1075;&#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;; &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084; &#1080;&#1093; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082;;</P>
</UL>
<UL>
	<LI><P CLASS="western"><I>&#1072;&#1085;&#1085;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;</I> &#1090;&#1101;&#1075;&#1080;, &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1103; &#1080;&#1093; &#1086;&#1076;&#1080;&#1085; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; <BR><BR>&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085; &lt;f0&gt;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;&lt;/f0&gt;<BR>&#1085;&#1072;<BR>&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085; &lt;f0&gt;&lt;/f0&gt;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;</P>
	<P CLASS="western">&#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1101;&#1090;&#1086; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;.</P>
</UL>
<H3 CLASS="western">&#1052;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1103;&#1094;&#1080;&#1103; &#1090;&#1101;&#1075;&#1072;&#1084;&#1080; &#1074; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093; HTML</H3>
<UL>
	<LI><P CLASS="western">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090;&#1084;&#1077;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1084; &#1090;&#1101;&#1075;&#1086;&#1084; &#1074; &#1092;&#1086;&#1088;&#1084;&#1077; &lt;xx&gt;, &#1072; &#1082;&#1086;&#1085;&#1077;&#1094; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#8212; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1084; &#1090;&#1101;&#1075;&#1086;&#1084; &lt;/xx&gt;. &#1051;&#1102;&#1073;&#1099;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1093; &#1090;&#1101;&#1075;&#1086;&#1074; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1086;&#1073;&#1086;&#1080;&#1084;&#1080; &#1090;&#1101;&#1075;&#1072;&#1084;&#1080; &#1074; &#1087;&#1072;&#1088;&#1077;.</P>
</UL>
<UL>
	<LI><P CLASS="western" STYLE="font-style: normal">&#1058;&#1101;&#1075;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; <I>&#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100;</I>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1085;&#1086;&#1077; &#1085;&#1072;&#1095;&#1077;&#1088;&#1090;&#1072;&#1085;&#1080;&#1077; &#1080;&#1079; 
	</P>
</UL>
<P CLASS="text-body-indent-western">&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085; &lt;f0&gt;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;&lt;/f0&gt;</P>
<P CLASS="text-body-indent-western">&#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1077; &#1090;&#1101;&#1075;&#1080; &lt;f0&gt; &#1080; &lt;/f0&gt;.</P>
<UL>
	<LI><P CLASS="western" STYLE="font-style: normal">&#1058;&#1101;&#1075;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; <I>&#1076;&#1091;&#1073;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;</I>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,</P>
</UL>
<P CLASS="text-body-indent-western">&#1069;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085; &lt;f0&gt;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;&lt;/f0&gt;, &#1080; &lt;f0&gt;&#1101;&#1090;&#1086;&#1090;&lt;/f0&gt; &#1090;&#1086;&#1078;&#1077;</P>
<P CLASS="text-body-indent-western">&#1079;&#1076;&#1077;&#1089;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086; &#1082; &#1089;&#1083;&#1086;&#1074;&#1091; &laquo;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;&raquo; &#1080; &#1082; &#1089;&#1083;&#1086;&#1074;&#1091; &laquo;&#1101;&#1090;&#1086;&#1090;&raquo;;.</P>
<UL>
	<LI><P CLASS="western" STYLE="font-style: normal">&#1052;&#1086;&#1078;&#1085;&#1086; <I>&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082;</I> &#1090;&#1101;&#1075;&#1086;&#1074;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,</P>
</UL>
<P CLASS="text-body-indent-western" STYLE="font-style: normal">&#1069;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085; &lt;f0&gt;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;&lt;/f0&gt;, &#1101;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &lt;f1&gt;&#1089; &#1087;&#1086;&#1076;&#1095;&#1105;&#1088;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;&lt;/f1&gt;</P>
<P CLASS="text-body-indent-western" STYLE="font-style: normal">&#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1085;&#1072; 
</P>
<P CLASS="text-body-indent-western" STYLE="font-style: normal">&#1069;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085; &lt;f1&gt;&#1089; &#1087;&#1086;&#1076;&#1095;&#1105;&#1088;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;&lt;/f1&gt;, &#1101;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &lt;f0&gt;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;&lt;/f0&gt;</P>
<UL>
	<LI><P CLASS="western" STYLE="font-style: normal">&#1058;&#1101;&#1075;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; <I>&#1074;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1090;&#1100;</I>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,</P>
</UL>
<P CLASS="text-body-indent-western" STYLE="font-style: normal">&#1069;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085; &lt;f0&gt;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;&lt;/f0&gt;, &#1101;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &lt;f1&gt;&#1089; &#1087;&#1086;&#1076;&#1095;&#1105;&#1088;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;&lt;/f1&gt;</P>
<P CLASS="text-body-indent-western" STYLE="font-style: normal">&#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1085;&#1072; 
</P>
<P CLASS="text-body-indent-western" STYLE="font-style: normal">&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085; &lt;f0&gt;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;, &#1072; &lt;f1&gt;&#1101;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089; &#1087;&#1086;&#1076;&#1095;&#1105;&#1088;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;&lt;/f1&gt;&lt;/f0&gt;</P>
<UL>
	<LI><P CLASS="western" STYLE="font-style: normal">&#1058;&#1101;&#1075;&#1080; <B>&#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;</B> <I>&#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;</I>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:</P>
</UL>
<P CLASS="text-body-indent-western" STYLE="font-style: normal">&#1069;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1073;&#1088;&#1072;&#1085; &lt;f0&gt;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;, &#1101;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089; &lt;f1&gt;&#1089; &#1087;&#1086;&#1076;&#1095;&#1105;&#1088;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;&lt;/f0&gt;, &#1101;&#1090;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1089; &#1087;&#1086;&#1076;&#1095;&#1105;&#1088;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;, &#1085;&#1086; &#1085;&#1077; &#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1086;&#1084;&lt;/f1&gt;</P>
<P CLASS="text-body-indent-western" STYLE="font-style: normal">&#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086; &#1080; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1090; &#1082; &#1087;&#1086;&#1074;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1102; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1090;&#1101;&#1075;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1077;&#1097;&#1105; &#1086;&#1076;&#1080;&#1085; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1090;&#1101;&#1075;, &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1090;&#1101;&#1075; &#1082; <B>&#1074;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091;</B> &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1084;&#1091; &#1090;&#1101;&#1075;&#1091; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; <B>&#1076;&#1086;</B> &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1090;&#1101;&#1075;&#1072; &#1082; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084;&#1091;.</P>
<H2 CLASS="western">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1090;&#1101;&#1075;&#1086;&#1074;</H2>
<P CLASS="western">&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1090;&#1101;&#1075;&#1086;&#1074; (<I>&#1057;&#1077;&#1088;&#1074;&#1080;&#1089;</I> > <I>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1090;&#1101;&#1075;&#1086;&#1074;</I>) &#1074;&#1099;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090; &#1090;&#1101;&#1075;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; (&#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086; &#1080;&#1083;&#1080; &#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086;), &#1080; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1079;&#1072;&#1090;&#1088;&#1086;&#1085;&#1091;&#1090;&#1099;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099;.</P><br><P><A HREF="en_OmegaT.html">&#1042;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1074; &#1086;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</A></P>
</BODY>
</HTML>