<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<meta http-equiv="content-type" content="text/html; charset=UTF-8">
	<TITLE>&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.0  (Linux)">
	<META NAME="CREATED" CONTENT="20030305;14173800">
	<META NAME="CHANGED" CONTENT="20040420;20053100">
	<STYLE>
	<!--
		@page { margin: 2cm }
		H1.western { font-family: "Helvetica", sans-serif; font-size: 14pt }
		P { margin-bottom: 0.21cm; text-decoration: none }
		P.western { font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
	-->
	</STYLE>
</HEAD>
<BODY LANG="ru-RU" DIR="LTR">
<H1 CLASS="western"><B>&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</B></H1>
<P CLASS="western">&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; OmegaT &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1080;&#1079; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; OmegaT &#1080; &#1086;&#1082;&#1085;&#1072; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1081;.</P>
<P CLASS="western">&#1043;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; OmegaT &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;. &#1044;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080;&#1073;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1083;&#1080;&#1073;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;, &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1105;&#1085; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;, &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;. &#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103; &#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1081; &#1087;&#1086;&#1083;&#1091;&#1078;&#1080;&#1088;&#1085;&#1099;&#1084; &#1085;&#1072;&#1095;&#1077;&#1088;&#1090;&#1072;&#1085;&#1080;&#1077;&#1084;, &#1080; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;, &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1084;&#1099;&#1081; &#1084;&#1077;&#1078;&#1076;&#1091; &#1090;&#1101;&#1075;&#1072;&#1084;&#1080; &lt;segment &#1085;&#1086;&#1084;&#1077;&#1088;...&gt; &#1080; &lt;end segment&gt;. 
</P>
<P CLASS="western">&#1054;&#1082;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1081; &#1080; &#1075;&#1083;&#1086;&#1089;&#1089;&#1072;&#1088;&#1080;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086; &#1085;&#1072; &#1076;&#1074;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;. &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077;&#1095;&#1105;&#1090;&#1082;&#1080;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1103; (&#1088;&#1072;&#1085;&#1077;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1105;&#1085;&#1085;&#1099;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;&#1077; &#1089;&#1093;&#1086;&#1076;&#1089;&#1090;&#1074;&#1086; &#1089; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;). &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1075;&#1083;&#1086;&#1089;&#1089;&#1072;&#1088;&#1080;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1080;&#1079; &#1092;&#1072;&#1081;&#1083;&#1072; &#1075;&#1083;&#1086;&#1089;&#1089;&#1072;&#1088;&#1080;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1077;&#1089;&#1090;&#1100;.</P>
<P CLASS="western">&#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1085;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1086;&#1082;&#1085;&#1072;. &#1055;&#1088;&#1080; &#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1086;&#1082;&#1085;&#1086; &#1089;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1085;&#1080;&#1093;.</P>
<P CLASS="western">&#1042;&#1089;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1095;&#1077;&#1088;&#1077;&#1079; &#1084;&#1077;&#1085;&#1102; &#1074;&#1074;&#1077;&#1088;&#1093;&#1091; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; OmegaT. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;.</P><br><P><A HREF="en_OmegaT.html">&#1042;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1074; &#1086;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</A></P>
</BODY>
</HTML>