<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-15">
	<TITLE>Guardar, revisar y compilar la traducci&oacute;n </TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice 7  (Linux)">
	<META NAME="CREATED" CONTENT="20030305;14173900">
	<META NAME="CHANGED" CONTENT="20041026;11223700">
	<STYLE>
	<!--
		@page { margin: 2cm }
		H1.western { font-family: "Helvetica", sans-serif; font-size: 14pt }
		P { margin-bottom: 0.21cm; text-decoration: none }
		P.western { font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
		H2.western { font-family: "Helvetica", sans-serif; font-size: 12pt; font-style: normal }
		H2.cjk { font-size: 14pt; font-style: italic }
		H2.ctl { font-size: 14pt; font-style: italic }
	-->
	</STYLE>
</HEAD>
<BODY LANG="es-ES" DIR="LTR">
<H1 CLASS="western">Guardar, revisar y compilar la traducci&oacute;n 
</H1>
<H2 CLASS="western">Guardar</H2>
<P CLASS="western">Para guardar su trabajo en cualquier momento,
seleccione <I>Archivo</I> &gt; <I>Guardar</I>, o simplemente pulse
<I>Ctrl+S</I>. 
</P>
<P CLASS="western">Esto guarda su traducci&oacute;n no como un
documento, sino como una memoria intermedia de traducci&oacute;n, en
el archivo <I>/omegat/project_save.tmx</I>.</P>
<H2 CLASS="western">Revisar</H2>
<P CLASS="western">Para revisar el texto comparando la traducci&oacute;n
con el original, rec&oacute;rralo simplemente segmento a segmento con
<I>Intro</I>. Los traductores familiarizados con otras aplicaciones
de memoria de traducci&oacute;n apreciar&aacute;n este c&oacute;modo
m&eacute;todo de revisar los borradores.</P>
<H2 CLASS="western">Compilar</H2>
<P CLASS="western">&iexcl;No se deje intimidar por la jerga
inform&aacute;tica! 
</P>
<P CLASS="western">Mientras traduce en OmegaT, no est&aacute;
<SPAN LANG="es-ES">sobrescribiendo</SPAN> el texto original, sino
a&ntilde;adiendo la traducci&oacute;n de cada p&aacute;rrafo en un
archivo independiente. La compilaci&oacute;n es simplemente el
proceso mediante el cual OmegaT utiliza las traducciones de este
archivo para sustituir los segmentos del texto original. Genera
asimismo una memoria de traducci&oacute;n en su forma final y
<SPAN LANG="es-ES">reutilizable.</SPAN> No es necesario que espere
hasta que la traducci&oacute;n est&eacute; acabada para compilarla;
puede compilar todas las veces que desee.</P>
<H2 CLASS="western">Evitar desastres</H2>
<UL>
	<LI><P CLASS="western">Realice sistem&aacute;ticamente copias del
	archivo <I>/omegat/project_save.tmx</I>. A&ntilde;ada un n&uacute;mero
	de serie o la fecha a la copia, por ejemplo
	<I>/omegat/project_save.tmx-01</I> o
	<I>/omegat/project_save.tmx-04-05-04</I>. Este archivo puede tambi&eacute;n
	transferirse a otros medios de almacenamiento, como un disquete,
	como forma c&oacute;moda de realizar con rapidez copias de respaldo.
	Cuando est&eacute; traduciendo, en particular, archivos con formato
	(StarOffice/OpenOffice.org, XHTML o HTML), es probable que encuentre
	que el archivo <I>project_save.tmx</I> es mucho m&aacute;s peque&ntilde;o
	que los textos originales o finales.</P>
	<LI><P CLASS="western">Hasta que se haya familiarizado con OmegaT,
	compile a intervalos regulares y compruebe que el archivo compilado
	contenga la &uacute;ltima versi&oacute;n de su traducci&oacute;n.</P>
	<LI><P CLASS="western" STYLE="font-style: normal">Tenga un cuidado
	especial cuando introduzca cambios en los archivos situados en el
	directorio <I>/source</I> cuando est&eacute; en mitad de un
	proyecto. En ocasiones, querr&aacute; introducir cambios en los
	archivos de origen, por ejemplo para eliminar saltos de p&aacute;gina
	situados en mitad de oraciones. Sin embargo, si el archivo de origen
	es modificado despu&eacute;s de haber comenzado la traducci&oacute;n,
	OmegaT puede no ser capaz de encontrar un segmento que usted haya ya
	traducido. Realice siempre una copia de respaldo del archivo de
	origen en cuesti&oacute;n, o del proyecto completo, antes de
	introducir cambio alguno en los archivos de origen.</P>
	<LI><P CLASS="western">No intente crear un nuevo proyecto ni abrir
	otro proyecto mientras est&eacute; uno ya abierto. Cierre el
	proyecto abierto, y si es necesario vuelva a ejecutar OmegaT, antes
	de abrir otro proyecto.</P>
</UL>
<P CLASS="western"><BR><BR>
</P>
<P CLASS="western"><A HREF="en_OmegaT.html">Volver al &iacute;ndice</A></P>
</BODY>
</HTML>