<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-15">
	<TITLE>Trabajar con archivos OpenOffice.org y StarOffice</TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice 7  (Linux)">
	<META NAME="CREATED" CONTENT="20030305;14173900">
	<META NAME="CHANGED" CONTENT="20041026;11272800">
	<STYLE>
	<!--
		@page { margin: 2cm }
		H1.western { font-family: "Helvetica", sans-serif; font-size: 14pt }
		P { margin-bottom: 0.21cm; text-decoration: none }
		P.western { font-family: "Nimbus Sans L"; font-size: 12pt; font-style: normal }
		H2.western { font-family: "Helvetica", sans-serif; font-size: 12pt; font-style: normal }
		H2.cjk { font-size: 14pt; font-style: italic }
		H2.ctl { font-size: 14pt; font-style: italic }
	-->
	</STYLE>
</HEAD>
<BODY LANG="es-ES" DIR="LTR">
<H1 CLASS="western"><B>Trabajar con archivos OpenOffice.org y
StarOffice</B></H1>
<P CLASS="western">Consulte tambi&eacute;n <A HREF="en_Tags.html">Edici&oacute;n
de textos con etiquetas (con formato)</A></P>
<H2 CLASS="western">OpenOffice.org y StarOffice: la diferencia</H2>
<P CLASS="western">OpenOffice.org y StarOffice son, en t&eacute;rminos
generales, el mismo programa. OpenOffice.org es de c&oacute;digo
abierto, lo que b&aacute;sicamente significa que es gratuito, y que
puede copiarse gratuitamente. StarOffice es un producto comercial:
debe adquirirse una licencia para cada sistema en el que se desee
utilizar. StarOffice contiene ciertos componentes que no est&aacute;n
presentes en OpenOffice.org; la adquisici&oacute;n de una licencia
tambi&eacute;n permite contar con soporte t&eacute;cnico. Para los
prop&oacute;sitos de este manual, todas las referencias a
OpenOffice.org resultan igualmente aplicables a StarOffice.</P>
<H2 CLASS="western">OpenOffice.org y OmegaT</H2>
<P CLASS="western">OmegaT es una aplicaci&oacute;n independiente. No
requiere para su utilizaci&oacute;n OpenOffice.org, StarOffice, MS
Word ni ning&uacute;n otro procesador de textos. 
</P>
<P CLASS="western">Sin embargo, OpenOffice.org/StarOffice ampl&iacute;an
considerablemente la funcionalidad de OmegaT, ya que le permiten
manejar archivos en formatos que no soporta de forma directa; en
particular, archivos MS Word, MS Excel, MS PowerPoint y RTF. Para
preparar archivos en estos formatos a fin de ser procesados en
OmegaT, &aacute;bralos simplemente en OpenOffice.org y gu&aacute;rdelos
en el formato nativo de OpenOffice.org. Cuando haya concluido su
traducci&oacute;n, &aacute;bralos de nuevo en OpenOffice.org y
gu&aacute;rdelos en su formato original.</P>
<P CLASS="western">OpenOffice.org/StarOffice a&ntilde;aden asimismo
funcionalidad adicional a las funciones b&aacute;sicas de OmegaT. La
comprobaci&oacute;n ortogr&aacute;fica y la segmentaci&oacute;n por
oraciones en vez de por p&aacute;rrafos son dos funciones que OmegaT
no proporciona por s&iacute; mismo pero que resultan posibles con
OpenOffice.org.</P>
<P CLASS="western" STYLE="font-style: normal; text-decoration: none"><FONT COLOR="#330000"><FONT FACE="Nimbus Sans L">Utilice
OpenOffice.org 1.0/StarOffice 6.0 o una versi&oacute;n posterior en
conjunci&oacute;n con OmegaT. Versiones anteriores (como
OpenOffice.org Beta) puede que no funcionen. StarOffice 5.2 <B>no</B>
funcionar&aacute; con toda seguridad.</FONT></FONT></P>
<H2 CLASS="western">Consejos y sugerencias</H2>
<P CLASS="western">Compruebe que los archivos de MS Word no se hayan
guardado con la opci&oacute;n &quot;Permitir guardar r&aacute;pidamente&quot;
activada, o OpenOffice.org ser&aacute; probablemente incapaz de
leerlos.</P>
<P CLASS="western">No intente cargar archivos OpenOffice.org
guardados con la funci&oacute;n &quot;Revisi&oacute;n&quot; (esto es,
&quot;Registrar cambios&quot;) activa en OmegaT. Desactive la funci&oacute;n
y acepte todos los cambios antes de hacerlo. Este problema puede
sobre todo presentarse cuando recibe archivos MS Word que han sido
guardados con la funci&oacute;n &quot;Revisi&oacute;n&quot; activada,
y usted no es consciente de ello. OpenOffice.org soporta esta funci&oacute;n
(que de hecho resulta muy &uacute;til), pero no debe ser utilizada en
conjunci&oacute;n con OmegaT.</P>
<P CLASS="western">Obtenga e instale las herramientas de correcci&oacute;n
ortogr&aacute;fica de OpenOffice.org para sus idiomas de destino. A
continuaci&oacute;n, y antes de cargar un proyecto que contenga
archivos OpenOffice.org por vez primera, abra estos archivos en
OpenOffice.org y cambie el idioma del texto a su idioma de destino
marcando todo el texto con <I>Ctrl-A</I>, y a continuaci&oacute;n
<I>Formato</I> &gt; <I>Car&aacute;cter</I> &gt; <I>Idioma</I>. Puede
entonces utilizar OpenOffice.org para revisar la ortograf&iacute;a de
la traducci&oacute;n ya finalizada tras la compilaci&oacute;n. Puede
cambiar el idioma tras compilar, pero si compila m&aacute;s de una
vez el idioma volver&aacute; a ser el del texto de origen cada vez
que compile.</P>
<P CLASS="western" STYLE="font-weight: medium">Tras compilar un texto
en formato OpenOffice.org por &uacute;ltima vez, compruebe que todo
haya sido traducido. Probablemente quiera abrir el archivo en
OpenOffice.org en cualquier caso, a fin de revisar la ortograf&iacute;a.
Puede no obstante que encuentre que OmegaT ha ignorado partes del
texto, como los encabezamientos y los pies de p&aacute;gina. 
</P>
<P CLASS="western" STYLE="font-weight: medium">En caso de que
OpenOffice.org no pueda abrir un archivo traducido y presente un
mensaje de error, es probable que haya da&ntilde;ado accidentalmente
las etiquetas durante el proceso de traducci&oacute;n. En este caso,
abra de nuevo el proyecto y utilice la herramienta Validar etiquetas
para localizar los segmentos afectados.</P>
<P CLASS="western"><BR><BR>
</P>
<P CLASS="western"><A HREF="en_OmegaT.html">Volver al &iacute;ndice</A></P>
</BODY>
</HTML>